{"keras_version": "2.2.2", "config": [{"config": {"stateful": false, "return_state": false, "bias_constraint": null, "batch_input_shape": [null, null, 1000], "recurrent_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "unroll": false, "kernel_constraint": null, "kernel_regularizer": null, "dropout": 0.5, "name": "lstm_1", "activation": "tanh", "unit_forget_bias": true, "units": 512, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 15, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}